//Задача 19. Напишите программу, которая принимает на вход пятизначное число 
//и проверяет, является ли оно палиндромом. Через строку решать нельзя.
//14212 -> нет
//12821 -> да
//23432 -> да

//Console.WriteLine("Введите число: ");
//string number = Console.ReadLine();
//int len = number.Length;

//if (len == 5)
{
    //if (number[0] == number[4] && number[1] == number[3])
    //{
//        Console.WriteLine($"{number} - Палиндром");
    //}
    //else
    //{
        //Console.WriteLine($"{number} - НЕ палиндром");
    //}
//}
//else
//{
    //Console.WriteLine($"ОШИБКА: {number} - не является пятизначным");
//}

//Задача 21. Напишите программу, которая принимает на вход координаты двух 
//точек и находит расстояние между ними в 3D пространстве.

//A (3,6,8); B (2,1,-7), -> 15.84
//A (7,-5, 0); B (1,-1,9) -> 11.53
